In [20]:
import pandas as pd
import numpy as np
df = pd.read_csv("D:/ISB/datasets/data_house/data_house.csv",index_col=0)
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [21]:
# df.columns = list(map(lambda x: x.lower().strip(), df.columns))
# df.columns

In [22]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [23]:
print(df.price.describe())

count    2.161300e+04
mean     5.400881e+05
std      3.671272e+05
min      7.500000e+04
25%      3.219500e+05
50%      4.500000e+05
75%      6.450000e+05
max      7.700000e+06
Name: price, dtype: float64

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 3.6+ MB

In [25]:
df.bedrooms.value_counts()

bedrooms
3     9824
4     6882
2     2760
5     1601
6      272
1      199
7       38
0       13
8       13
9        6
10       3
11       1
33       1
Name: count, dtype: int64

In [26]:
# (df.isnull().sum() / len(df)) * 100

In [27]:
# Number of duplicate rows
df.duplicated().sum()

# Remove duplicates (if needed)
# df = df.drop_duplicates()

0

# finding house age in years (new column)

In [28]:
df["house_age"] = df["yr_built"].apply(lambda x: 2025 - x)
df[["yr_built", "house_age"]].head()

   yr_built  house_age
0      1955         70
1      1951         74
2      1933         92
3      1965         60
4      1987         38

## creating price categories for better understanding of the house prices

In [29]:
df["price_category"] = df["price"].apply(
    lambda x: "Low" if x < 300000 else ("Medium" if x < 800000 else "High")
)
df["price_category"].value_counts()

price_category
Medium    14174
Low        4437
High       3002
Name: count, dtype: int64

In [30]:
# if "waterfront" in df.columns:
#     df["waterfront"] = df["waterfront"].map({0: "No", 1: "Yes"})

# df = df.apply(lambda col: col.fillna(col.median()) if col.dtype != "object" else col)

## Detect Outliers Flag using Lambda

In [31]:
q1 = df["price"].quantile(0.25)
q3 = df["price"].quantile(0.75)
iqr = q3 - q1

df["price_outlier"] = df["price"].apply(
    lambda x: 1 if (x < (q1 - 1.5*iqr)) or (x > (q3 + 1.5*iqr)) else 0
)
df["price_outlier"].value_counts()

price_outlier
0    20467
1     1146
Name: count, dtype: int64

## Transform Skewed Columns using Lambda (ML-Ready EDA)

In [32]:
df["log_price"] = df["price"].apply(lambda x: np.log1p(x))

## Quick Column Summary using Map

In [33]:
summary = dict(map(lambda col: (col, df[col].nunique()), df.columns))
summary

{'id': 21436,
 'date': 372,
 'price': 4028,
 'bedrooms': 13,
 'bathrooms': 30,
 'sqft_living': 1038,
 'sqft_lot': 9782,
 'floors': 6,
 'waterfront': 2,
 'view': 5,
 'condition': 5,
 'grade': 12,
 'sqft_above': 946,
 'sqft_basement': 306,
 'yr_built': 116,
 'yr_renovated': 70,
 'zipcode': 70,
 'lat': 5034,
 'long': 752,
 'sqft_living15': 777,
 'sqft_lot15': 8689,
 'house_age': 116,
 'price_category': 3,
 'price_outlier': 2,
 'log_price': 4028}